app/Services/ApiPeruService.php

select * from `companies` limit 1
select * from `sunat_connections` where `sunat_connections`.`company_id` = 1 and `sunat_connections`.`company_id` is not null limit 1
---
    public function lookup(string $docType, string $doc): array
    {
        $token = optional(optional(Company::query()->first())->sunatConnection)->token_apiperu;