app/Http/Controllers/Api/AttributeValueController.php

select `id`, `value`, `attribute_id` from `attribute_values` where `attribute_id` = '1' and `id` in (1, 8, 9)
---
    public function index(Request $request, $attributeId)
    {
        return AttributeValue::select('id', 'value', 'attribute_id')
            ->where('attribute_id', $attributeId)
            ->when($request->search, function ($query, $search) {
                $query->where('value', 'like', "%{$search}%");
            })
            ->when(
                $request->exists('selected'),
                fn($query) => $query->whereIn('id', $request->input('selected', [])),
                fn($query) => $query->limit(20)
            )
            ->get();