app/Http/Controllers/Api/AttributeController.php

select `id`, `name` from `attributes` where `id` in (1)
---
    public function index(Request $request)
    {
        return Attribute::select('id', 'name')
            ->when($request->search, function ($query, $search) {
                $query->where('name', 'like', "%{$search}%");
            })
            ->when(
                $request->exists('selected'),
                fn($query) => $query->whereIn('id', $request->input('selected', [])),
                fn($query) => $query->limit(10)
            )
            ->get();