app/Http/Controllers/Api/CategoryController.php

    public function index()
    {
        return Category::query()->select(['id', 'name'])->get();
---
select `id`, `name` from `categories`