app/Http/Controllers/Api/IdentityController.php

select `id`, `name` from `identities` order by `id` asc
---
    public function index()
    {
        return Identity::select('id', 'name')->orderBy('id')->get();