app/Http/Controllers/Api/LoyaltyPosController.php

    public function config(Request $request)
    {
        $program = LoyaltyProgram::query()
            ->where('is_active', true)
            ->where('type', 'points')
            ->whereIn('scope', ['pos', 'both'])
            ->where(function ($q) {
                $q->whereNull('valid_from')->orWhere('valid_from', '<=', now());
            })
            ->where(function ($q) {
                $q->whereNull('valid_to')->orWhere('valid_to', '>=', now());
            })
            ->orderBy('id')
            ->first();

        $activeForPos = $program !== null;

        $earnPerSol = 0.0;
        $canRedeem = false;
        $solesPerPoint = 0.0;
        $maxDiscountAmount = null;

        if ($activeForPos) {
            // Regla de acumulación por monto (scope all)
            $earnRule = LoyaltyEarnRule::query()
                ->where('program_id', $program->id)
                ->where('is_active', true)
                ->where('basis', 'per_amount')
                ->where(function ($q) {
                    $q->whereNull('scope_type')->orWhere('scope_type', 'all');
                })
                ->orderByDesc('priority')
                ->first();
---
select * from `loyalty_programs` where `is_active` = 1 and `type` = 'points' and `scope` in ('pos', 'both') and (`valid_from` is null or `valid_from` <= '2026-01-27 15:45:18') and (`valid_to` is null or `valid_to` >= '2026-01-27 15:45:18') order by `id` asc limit 1
select * from `loyalty_earn_rules` where `program_id` = 1 and `is_active` = 1 and `basis` = 'per_amount' and (`scope_type` is null or `scope_type` = 'all') order by `priority` desc limit 1

            }

            // Recompensa de descuento por puntos a nivel de orden
            $reward = LoyaltyReward::query()
                ->where('program_id', $program->id)
                ->where('is_active', true)
                ->where('reward_type', 'discount')
                ->where('discount_method', 'soles_per_point')
                ->where(function ($q) {
                    $q->whereNull('discount_scope')->orWhere('discount_scope', 'order');
                })
                ->orderByDesc('priority')
                ->first();
---
select * from `loyalty_rewards` where `program_id` = 1 and `is_active` = 1 and `reward_type` = 'discount' and `discount_method` = 'soles_per_point' and (`discount_scope` is null or `discount_scope` = 'order') order by `priority` desc limit 1