app/Http/Controllers/Api/PaymentMethodController.php

    public function index(Request $request)
    {
        $methods = PaymentMethod::query()
            ->where('is_active', true)
            ->orderBy('name')
            ->get(['id', 'name']);
---
select `id`, `name` from `payment_methods` where `is_active` = 1 order by `name` asc