app/Http/Controllers/Api/PosSessionController.php

    public function setOpeningBalance(Request $request, int $id)
    {
        /** @var PosSession $session */
        $session = PosSession::query()->findOrFail($id);

        if ($session->status !== 'open') {
            return response()->json(['message' => 'La sesión no está abierta'], 422);
        }

        $validated = $request->validate([
            'opening_balance' => 'required|numeric',
        ]);

        $session->opening_balance = $validated['opening_balance'];
        $session->save();
---
select * from `pos_sessions` where `pos_sessions`.`id` = 1 limit 1
update `pos_sessions` set `opening_balance` = 200, `pos_sessions`.`updated_at` = '2026-01-27 15:29:48' where `id` = 1