app/Http/Controllers/Api/SupplierController.php

    public function index(Request $request)
    {
        return Supplier::select('id', 'name')
            ->when($request->search, function ($query, $search) {
                $query->where('name', 'like', "{$search}")
                    ->orWhere('document_number', 'like', "{$search}");
            })
            ->when(
                $request->exists('selected'),
                fn($query) => $query->whereIn('id', $request->input('selected', [])),
                fn($query) => $query->limit(10)
            )->get();
---
select `id`, `name` from `suppliers` where `id` in (1)