app/Http/Controllers/Api/VariantController.php

select * from `products` where `products`.`id` in (11, 45, 62, 73, 75, 80, 90, 98)
select * from `variants` where exists (select * from `products` where `variants`.`product_id` = `products`.`id` and `category_id` = '8') limit 24
select `attribute_values`.*, `attribute_value_variant`.`variant_id` as `pivot_variant_id`, `attribute_value_variant`.`attribute_value_id` as `pivot_attribute_value_id` from `attribute_values` inner join `attribute_value_variant` on `attribute_values`.`id` = `attribute_value_variant`.`attribute_value_id` where `attribute_value_variant`.`variant_id` in (29, 30, 31, 106, 107, 108, 159, 188, 189, 192, 193, 200, 201, 202, 219, 220, 221, 235, 236, 237)
---
    public function getVariantsPos(Request $request)
    {
        $variants = Variant::query()
            ->with(['product', 'attributeValues', 'images'])
            ->when($request->search, function ($query, $search) {
                $query->where('barcode', 'like', "%{$search}%")
                    ->orWhereHas('product', function ($q) use ($search) {
                        $q->where('name', 'like', "%{$search}%");
                    })
                    ->orWhereHas('attributeValues', function ($q) use ($search) {
                        $q->where('value', 'like', "%{$search}%");
                    });
            })
            ->when($request->category_id, function ($query, $categoryId) {
                $query->whereHas('product', function ($q) use ($categoryId) {
                    $q->where('category_id', $categoryId);
                });
            })
            ->when(
                $request->exists('selected'),
                fn($query) => $query->whereIn('variants.id', $request->input('selected', [])),
                fn($query) => $query->limit(24)
            )->get();