app/Livewire/Admin/Datatables/PosconfigTable.php

    public function columns(): array
    {
        return [
            Column::make("Id", "id")
                ->sortable(),
            Column::make("Name", "name")
                ->sortable(),
            Column::make("Warehouse", "warehouse.name")
                ->sortable(),
            Column::make("Is active", "is_active")
                ->sortable(),
            Column::make("Acciones")
                ->label(function ($row, Column $column) {
                    $hasOpen = PosSession::query()
                        ->where('pos_config_id', $row->id)
                        ->where('status', 'open')
                        ->whereNull('closed_at')
                        ->exists();
---
select exists(select * from `pos_sessions` where `pos_config_id` = 1 and `status` = 'open' and `closed_at` is null) as `exists`

    public function openSession(int $posConfigId): void
    {
        $userId = Auth::id();
        if (!$userId) {
            return;
        }

        /** @var PosConfig $posConfig */
        $posConfig = PosConfig::query()->findOrFail($posConfigId);

        if (! Gate::allows('read_pos_sessions', $posConfig)) {
            return;
        }

        // Si hay una sesión abierta para esta caja, continuar en esa
        $existing = PosSession::query()
            ->where('pos_config_id', $posConfig->id)
            ->where('status', 'open')
            ->whereNull('closed_at')
            ->orderByDesc('opened_at')
            ->first();
---
select * from `pos_configs` where `pos_configs`.`id` = 1 limit 1
select * from `pos_sessions` where `pos_config_id` = 1 and `status` = 'open' and `closed_at` is null order by `opened_at` desc limit 1