app/Livewire/Admin/Company/CompanySelector.php

    public function mount()
    {
        // 1. Cargar las compañías del usuario autenticado.
        //    Mostraremos solo las compañías "padre" y cargaremos las "hijas" en la relación.
        $this->allCompanies = Auth::user()->companies()->whereNull('parent_id')->with('children')->get();
---
select * from `companies` where `companies`.`parent_id` in (1)