app/Livewire/Admin/Company/CompanySelector.php

    public function mount()
    {
        // Cargar todas las compañías del usuario (padres e hijas en una sola colección)
        $this->companies = Auth::user()->companies()->with('children')->get()->flatMap(function ($company) {
            return collect([$company])->merge($company->children);
        });

        // Inicializar con las compañías seleccionadas desde la sesión
        $this->selectedCompanyIds = session('selected_company_ids', []);
        $this->activeCompanyId = session('active_company_id');

        // Si no hay compañías seleccionadas, seleccionar la primera por defecto
        if (empty($this->selectedCompanyIds) || empty($this->activeCompanyId)) {
            $firstCompany = Auth::user()->companies()->orderBy('id')->first();

            if ($firstCompany) {
                $this->selectedCompanyIds = [$firstCompany->id];
                $this->activeCompanyId = $firstCompany->id;
            } elseif ($this->companies->isNotEmpty()) {
                // Si no tiene compañías padre, usar la primera disponible
                $this->selectedCompanyIds = [$this->companies->first()->id];
                $this->activeCompanyId = $this->companies->first()->id;
---
select `companies`.*, `company_user`.`user_id` as `pivot_user_id`, `company_user`.`company_id` as `pivot_company_id` from `companies` inner join `company_user` on `companies`.`id` = `company_user`.`company_id` where `company_user`.`user_id` = 1
select `companies`.*, `company_user`.`user_id` as `pivot_user_id`, `company_user`.`company_id` as `pivot_company_id` from `companies` inner join `company_user` on `companies`.`id` = `company_user`.`company_id` where `company_user`.`user_id` = 1 order by `id` asc limit 1