app/Livewire/Admin/Qr/QrGenerator.php

    public function mount(string $type, int $id)
    {
        $this->type = $type;
        $this->id = $id;

        $this->styles = QrStyle::all();
        $defaultStyle = $this->styles->where('is_default', true)->first() ?? $this->styles->first();
        $this->applyStyle($defaultStyle);

        $variants = $this->loadVariants($type, $id);
        $usePivotQty = in_array($type, ['purchase', 'purchase-order'], true);

        $this->labels = $variants->map(function (Variant $variant) use ($usePivotQty) {
            $description = $variant->attributeValues->pluck('value')->implode(' / ') ?: 'Default';
            $qty = 1;
            if ($usePivotQty) {
                $qty = (int) ($variant->pivot->quantity ?? 1);
                $qty = max(0, $qty);
            }
            return [
                'id' => $variant->id,
                'product_name' => optional($variant->product)->name,
                'description' => $description,
                'full_name' => method_exists($variant, 'getFullNameAttribute') ? $variant->fullName : trim((optional($variant->product)->name . ' ' . $description)),
                'sku' => $variant->sku,
                'barcode' => $variant->barcode,
                'price' => $variant->price,
                'payload' => $this->makeQrData($variant),
                'qty' => $qty,
            ];
        })->toArray();
---
select * from `qr_styles`
select * from `products` where `products`.`id` in (1)
select * from `variants` where `variants`.`product_id` in (1)
select `attribute_values`.*, `attribute_value_variant`.`variant_id` as `pivot_variant_id`, `attribute_value_variant`.`attribute_value_id` as `pivot_attribute_value_id` from `attribute_values` inner join `attribute_value_variant` on `attribute_values`.`id` = `attribute_value_variant`.`attribute_value_id` where `attribute_value_variant`.`variant_id` in (1, 2, 3)

    private function loadVariants(string $type, int $id)
    {
        if ($type === 'product') {
            $product = Product::with(['variants.attributeValues', 'variants.product'])->findOrFail($id);
            return $product->variants;
        }
        if ($type === 'purchase') {
            $purchase = Purchase::with(['variants.attributeValues', 'variants.product'])->findOrFail($id);
---
select * from `products` where `products`.`id` = 1 limit 1
select * from `products` where `products`.`id` in (1, 3)
select * from `purchases` where `purchases`.`id` = 1 limit 1
select `attribute_values`.*, `attribute_value_variant`.`variant_id` as `pivot_variant_id`, `attribute_value_variant`.`attribute_value_id` as `pivot_attribute_value_id` from `attribute_values` inner join `attribute_value_variant` on `attribute_values`.`id` = `attribute_value_variant`.`attribute_value_id` where `attribute_value_variant`.`variant_id` in (1, 3, 5)