app/Livewire/Admin/Form/ProductForm.php

select * from `categories` where `categories`.`id` in (7)
select * from `products` where `products`.`id` = 1 limit 1
select * from `variants` where `variants`.`product_id` in (1)
select `attribute_values`.*, `attribute_value_variant`.`variant_id` as `pivot_variant_id`, `attribute_value_variant`.`attribute_value_id` as `pivot_attribute_value_id` from `attribute_values` inner join `attribute_value_variant` on `attribute_values`.`id` = `attribute_value_variant`.`attribute_value_id` where `attribute_value_variant`.`variant_id` in (1, 2, 3)
---
    public function mount(?int $productId = null): void
    {
        $this->productId = $productId;
        $this->isEditing = filled($productId);

        if ($this->isEditing) {
            $product = Product::with(['variants.attributeValues', 'category'])->findOrFail($productId);

select * from `products` where `products`.`id` = 1 limit 1
---
    public function render()
    {
        return view('livewire.admin.form.product-form', [
            'categories' => Category::all(),
            'product' => $this->isEditing ? Product::with('images')->find($this->productId) : null,