app/Livewire/Admin/Form/PurchaseForm.php

select * from `taxes` where `is_active` = 1 order by `is_default` desc, `name` asc
select * from `journals` where `type` = 'purchase' order by `name` asc
select * from `sequences` where `sequences`.`id` in (10)
---
    public function mount(Purchase $purchase = null, $mode = 'create', $purchase_order_id = null)
    {
        $this->mode = $mode ?? ($purchase ? 'edit' : 'create');
        $this->purchase = $purchase;
        $this->purchase_order_id = $purchase_order_id;

        // Taxes
        $this->taxes = Tax::query()
            ->where('is_active', true)
            ->orderByDesc('is_default')
            ->orderBy('name')
            ->get()
            ->map(function ($t) {
                return [
                    'id' => $t->id,
                    'name' => $t->name,
                    'rate_percent' => (float) $t->rate_percent,
                    'is_price_inclusive' => (bool) $t->is_price_inclusive,
                    'is_default' => (bool) $t->is_default,
                    'invoice_label' => $t->invoice_label ?? null,
                ];
            })
            ->toArray();
        $default = collect($this->taxes)->firstWhere('is_default', true) ?? collect($this->taxes)->first();
        $this->default_tax_id = $default['id'] ?? null;

        // Journals
        $journals = Journal::where('type', 'purchase')->with('sequence')->orderBy('name')->get();

select * from `products` where `products`.`id` in (1, 3)
select * from `suppliers` where `suppliers`.`id` in (1)
---
        ])->toArray();

        if ($this->mode === 'edit' && $this->purchase) {
            $p = $this->purchase->load('variants.product', 'supplier', 'warehouse', 'purchaseOrder');

select * from `journals` where `journals`.`id` = 10 limit 1
select * from `sequences` where `sequences`.`id` in (10)
---
    protected function updatePreview(): void
    {
        if (!$this->journal_id) {
            $this->correlative = '';
            return;
        }
        $journal = Journal::with('sequence')->find($this->journal_id);