app/Livewire/Admin/Form/PurchaseForm.php

    protected function updatePreview(): void
    {
        if (!$this->journal_id) {
            $this->correlative = '';
            return;
        }
        $journal = Journal::with('sequence')->find($this->journal_id);
---
select * from `journals` where `journals`.`id` = 10 limit 1
select * from `sequences` where `sequences`.`id` in (10)