app/Models/Variant.php

select * from `products` where `products`.`id` in (1)
select `attribute_values`.*, `attribute_value_variant`.`variant_id` as `pivot_variant_id`, `attribute_value_variant`.`attribute_value_id` as `pivot_attribute_value_id` from `attribute_values` inner join `attribute_value_variant` on `attribute_values`.`id` = `attribute_value_variant`.`attribute_value_id` where `attribute_value_variant`.`variant_id` in (1)
---
    public function fullName(): Attribute
    {
        return Attribute::make(
            get: function () {
                if (!$this->relationLoaded('product') || !$this->relationLoaded('attributeValues')) {
                    $this->load('product', 'attributeValues');
                }

                $attributesString = $this->attributeValues->pluck('value')->implode(' - ');
                return $this->product->name . ($attributesString ? ' - ' . $attributesString : '');
            }
        );