app/Http/Controllers/Admin/AttributeController.php

    public function index()
    {
        Gate::authorize('read_attributes', Attribute::class);
        return view('admin.attributes.index', [
            'attributes' => Attribute::all()
        ]);
---
select * from `attributes`