app/Http/Controllers/Admin/InventoryController.php

    public function dashboard()
    {
        $stats = [
            'products_count' => Product::count(),
            'variants_count' => Variant::count(),
            'warehouses_count' => Warehouse::count(),
            'categories_count' => Category::count(),
            'attributes_count' => Attribute::count(),
            'total_stock' => Variant::sum('stock'),
        ];

        $categoryDistribution = Category::withCount('products')
            ->orderByDesc('products_count')
            ->take(8)
            ->get()
            ->map(function ($category) {
                return [
                    'name' => $category->name,
                    'value' => $category->products_count
                ];
            });

        $warehouseStock = DB::table('inventories')
            ->join('warehouses', 'inventories.warehouse_id', '=', 'warehouses.id')
            ->select('warehouses.name', DB::raw('SUM(IFNULL(quantity_in, 0) - IFNULL(quantity_out, 0)) as total_stock'))
            ->groupBy('warehouses.id', 'warehouses.name')
            ->having('total_stock', '>', 0)
            ->get();

        $recentProducts = Product::with('category', 'variants')->latest()->take(5)->get();
---
select count(*) as aggregate from `products`
select count(*) as aggregate from `variants`
select count(*) as aggregate from `categories`
select count(*) as aggregate from `attributes`
select sum(`stock`) as aggregate from `variants`
select `categories`.*, (select count(*) from `products` where `categories`.`id` = `products`.`category_id`) as `products_count` from `categories` order by `products_count` desc limit 8
select `warehouses`.`name`, SUM(IFNULL(quantity_in, 0) - IFNULL(quantity_out, 0)) as total_stock from `inventories` inner join `warehouses` on `inventories`.`warehouse_id` = `warehouses`.`id` group by `warehouses`.`id`, `warehouses`.`name` having `total_stock` > 0
select * from `categories` where `categories`.`id` in (2, 3, 5, 8, 9)
select * from `products` order by `created_at` desc limit 5