app/Http/Controllers/Admin/ProductController.php

select * from `categories`
---
    public function indexWeb()
    {
        Gate::authorize('read_products', Product::class);
        $products = Product::with(['variants', 'category'])->latest()->paginate(10);