app/Http/Controllers/Admin/ProductController.php

    public function index()
    {
        Gate::authorize('read_products', Product::class);
        $products = Product::query()->paginate(10);
---
select * from `products` limit 10 offset 0
select count(*) as aggregate from `products`

    public function indexWeb(Request $request)
    {
        Gate::authorize('read_products', Product::class);

        $query = Product::with(['variants.mainImage', 'mainImage', 'category']);

        if ($request->has('search') && $request->search) {
            $search = $request->search;
            $query->where(function ($q) use ($search) {
                $q->where('name', 'like', "%{$search}%")
                    ->orWhereHas('variants', function ($variantQuery) use ($search) {
                        $variantQuery->where('sku', 'like', "%{$search}%");
                    })
                    ->orWhereHas('variants', function ($variantQuery) use ($search) {
                        $variantQuery->where('barcode', 'like', "%{$search}%");
                    })
                    ->orWhereHas('category', function ($categoryQuery) use ($search) {
                        $categoryQuery->where('name', 'like', "%{$search}%");
                    });
            });
        }

        $products = $query->latest()->paginate(80);
---
select * from `categories` where `categories`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12)
select * from `products` order by `created_at` desc limit 80 offset 0
select count(*) as aggregate from `products`

    public function create()
    {
        Gate::authorize('create_products', Product::class);
        $categories = Category::all();
---
select * from `categories`