app/Http/Controllers/Admin/ReportController.php

select count(*) as aggregate from `variants` where `stock` <= 5
select count(*) as aggregate from `variants`
select count(*) as aggregate from `inventories`
---
    public function index()
    {
        $stats = [
            'total_valuation' => Variant::sum(DB::raw('stock * price')),
            'low_stock_count' => Variant::where('stock', '<=', 5)->count(),
            'total_items' => Variant::count(),
            'total_movements' => Inventory::count()