app/Http/Controllers/Admin/SunatConnectionController.php

select * from `companies` limit 1
---
    public function index()
    {
        $company = Company::first();
        if (!$company) {
            return redirect()->route('admin.companies.index')
                ->with('error', 'Debe crear una compañía primero.');