app/Livewire/Admin/Dashboard/SalesTopProducts.php

select `variant_id`, SUM(quantity) as total_qty, SUM(subtotal) as total_revenue from `variantables` where `variantable_type` = 'App\\Models\\Sale' and ((`variantables`.`variantable_type` = 'App\\Models\\Purchase' and exists (select * from `purchases` where `variantables`.`variantable_id` = `purchases`.`id` and `date` between '2026-01-01 00:00:00' and '2026-01-31 23:59:59'))) group by `variant_id` order by `total_qty` desc limit 10
---
    protected function fetchTopProducts(): array
    {
        try {
            // Parsear el mes seleccionado (YYYY-MM)
            $start = Carbon::parse($this->month . '-01')->startOfMonth();
            $end = Carbon::parse($this->month . '-01')->endOfMonth();

            $rows = Variantable::query()
                ->where('variantable_type', Sale::class)
                ->whereHas('variantable', function ($q) use ($start, $end) {
                    $q->whereBetween('date', [$start, $end]);
                })
                ->with(['variant.product', 'variant.attributeValues'])
                ->select([
                    'variant_id',
                    DB::raw('SUM(quantity) as total_qty'),
                    DB::raw('SUM(subtotal) as total_revenue'),
                ])
                ->groupBy('variant_id')
                ->orderByDesc('total_qty')
                ->limit(10)
                ->get();