app/Livewire/Admin/Dashboard/SalesTrendChart.php

    public function mount(): void
    {
        $this->month = now()->format('Y-m');
        $this->loadWarehouses();
        $this->companies = Company::select('id', 'name')->orderBy('name')->get()
            ->map(fn($c) => ['id' => (int) $c->id, 'name' => (string) $c->name])->toArray();
---
select `id`, `name` from `companies` order by `name` asc

    protected function fetchDailyRevenue(string $ym): array
    {
        $start = Carbon::parse($ym . '-01')->startOfMonth();
        $end = Carbon::parse($ym . '-01')->endOfMonth();

        $rows = Sale::query()
            ->whereBetween('date', [$start, $end])
            ->when($this->warehouseId, fn($q) => $q->where('warehouse_id', $this->warehouseId))
            ->when($this->companyId, fn($q) => $q->where('company_id', $this->companyId))
            ->selectRaw('DATE(date) as day, SUM(total) as revenue')
            ->groupBy('day')
            ->orderBy('day')
            ->get();
---
select DATE(date) as day, SUM(total) as revenue from `sales` where `date` between '2026-01-01 00:00:00' and '2026-01-31 23:59:59' group by `day` order by `day` asc

    protected function loadWarehouses(): void
    {
        $query = Warehouse::select('id', 'name')->orderBy('name');
        if ($this->companyId) {
            $query->where('company_id', $this->companyId);
        }
        $this->warehouses = $query->get()
            ->map(fn($w) => ['id' => (int) $w->id, 'name' => (string) $w->name])
            ->toArray();
---
select `id`, `name` from `warehouses` order by `name` asc