app/Livewire/Admin/Dashboard/SalesSummary.php

select count(*) as aggregate from `sales` where `date` between '2026-01-01 00:00:00' and '2026-01-31 23:59:59'
select sum(`total`) as aggregate from `sales` where `date` between '2026-01-01 00:00:00' and '2026-01-31 23:59:59'
select sum(`total`) as aggregate from `sales` where `date` between '2026-01-01 00:00:00' and '2026-01-31 23:59:59' and exists (select * from `journals` where `sales`.`journal_id` = `journals`.`id` and `document_type_code` in ('01', '03'))
select sum(`total`) as aggregate from `sales` where `date` between '2026-01-01 00:00:00' and '2026-01-31 23:59:59' and exists (select * from `journals` where `sales`.`journal_id` = `journals`.`id` and `document_type_code` = '07')
select sum(`total`) as aggregate from `sales` where `date` between '2026-01-01 00:00:00' and '2026-01-31 23:59:59' and exists (select * from `journals` where `sales`.`journal_id` = `journals`.`id` and `document_type_code` = '08')
---
    public function loadData(): void
    {
        $start = Carbon::parse($this->month . '-01')->startOfMonth();
        $end = Carbon::parse($this->month . '-01')->endOfMonth();

        $query = Sale::query()->whereBetween('date', [$start, $end]);

        $this->ordersCount = (int) $query->count();
        $this->totalSales = (float) ($query->sum('total') ?? 0);
        $this->avgTicket = $this->ordersCount > 0 ? $this->totalSales / $this->ordersCount : 0.0;

        // Cálculo de base neta considerando devoluciones (NC) y notas de débito (ND)
        $normalSalesSum = (float) Sale::query()
            ->whereBetween('date', [$start, $end])
            ->whereHas('journal', function ($q) {
                $q->whereIn('document_type_code', ['01', '03']); // Factura, Boleta
            })
            ->sum('total');

        $creditNotesSum = (float) Sale::query()
            ->whereBetween('date', [$start, $end])
            ->whereHas('journal', function ($q) {
                $q->where('document_type_code', '07'); // Nota de crédito
            })
            ->sum('total');

        $debitNotesSum = (float) Sale::query()
            ->whereBetween('date', [$start, $end])
            ->whereHas('journal', function ($q) {
                $q->where('document_type_code', '08'); // Nota de débito
            })
            ->sum('total');