app/Livewire/Admin/Dashboard/TopSellingPos.php

select `pos_sessions`.`pos_config_id` as `pos_config_id`, COALESCE(pos_configs.name, CONCAT("POS #", pos_sessions.pos_config_id)) as name, COUNT(sales.id) as orders, SUM(sales.total) as revenue from `sales` left join `pos_orders` on `pos_orders`.`id` = `sales`.`pos_order_id` left join `pos_sessions` on `pos_sessions`.`id` = `pos_orders`.`pos_session_id` left join `pos_configs` on `pos_configs`.`id` = `pos_sessions`.`pos_config_id` where `pos_order_id` is not null and `date` between '2026-01-01 00:00:00' and '2026-01-31 23:59:59' group by `pos_sessions`.`pos_config_id`, `pos_configs`.`name` order by `revenue` desc limit 15
---
    protected function fetchTopPos(): array
    {
        try {
            $start = Carbon::parse($this->month . '-01')->startOfMonth();
            $end = Carbon::parse($this->month . '-01')->endOfMonth();

            $rows = Sale::query()
                ->whereNotNull('pos_order_id')
                ->whereBetween('date', [$start, $end])
                ->leftJoin('pos_orders', 'pos_orders.id', '=', 'sales.pos_order_id')
                ->leftJoin('pos_sessions', 'pos_sessions.id', '=', 'pos_orders.pos_session_id')
                ->leftJoin('pos_configs', 'pos_configs.id', '=', 'pos_sessions.pos_config_id')
                ->select([
                    'pos_sessions.pos_config_id as pos_config_id',
                    DB::raw('COALESCE(pos_configs.name, CONCAT("POS #", pos_sessions.pos_config_id)) as name'),
                    DB::raw('COUNT(sales.id) as orders'),
                    DB::raw('SUM(sales.total) as revenue'),
                ])
                ->groupBy('pos_sessions.pos_config_id', 'pos_configs.name')
                ->orderByDesc('revenue')
                ->limit(15)
                ->get();